#띠별 2020년도 운세 
print('2020년 띠별 운세')
print('------------------')
list= ['쥐띠','소띠','호랑이띠','토끼티','용띠','뱀띠','말띠','양띠','원숭이띠','닭띠','개띠','돼지띠']
years=int(input('자신이 태어난 연도를 입력하시오!'))
if (years==2020)|(years==2008)|(years==199840)|(years==1972)|(years==1960)|(years==1948):#쥐띠
    print('쥐띠 입니다.')
    print('자신이 생각하고 있었던 좋은 기회들이 몰려오는 하루다. 하지만 다 취할 수 없으니 꼭 품을 수 있는 것만 잡아야 할 것이다.')
    print('만약 모든 것을 다 잡고 싶다거나 어떤 것이 당신에게 좋은 것인지를 판단하기 힘들다면, 오늘은 결정을 미뤄라.')
    print('하루만 시간을 가지고 신중히 생각하고 내일 선택해도 늦지 않을 것이다. 귀인이 당신에게 후한 선물을 준 하루가 될 것이다.')
elif(years==2009)|(years==1997)|(years==1985)|(years==1973)|(years==1961)|(years==1949)|(years==1937):#소띠
    print('소띠입니다.')
    print('이동 중에 좋지 않은 일이 있을 수 있으니, 주의를 기울이며 이동하는 것이 유리하다.')
    print('보험에 가입한 사람은 보험 약관을 확인하는 게 좋다. 오늘 하는 일들은 굳이 남이 알도록 드러내놓게 할 일들이 아니니 적당히 숨길 필요가 있다.')
elif(years==2010)|(years==1998)|(years==1986)|(years==1974)|(years==1962)|(years==1950)|(years==1938):#호랑이띠
    print('호랑이띠입니다')
    print('작은 이익에 모든 것을 건다면 큰 일을 성취할 수 없다. 돈으로 인한 유혹이 여기저기서 생겨날 수 있지만, 가능하면 거절하는 게 이롭다.')
    print('재물 이외에 더 좋은 재물을 찾을 수 있게 될 수 있기 때문이다. 주부는 외출을 삼가고 집 안에 머무르는 게 가족의 안녕을 위해서 좋다.')
elif(years==2011)|(years==1999)|(years==1987)|(years==1975)|(years==1963)|(years==1951)|(years==1939):#토끼띠
    print('토끼띠입니다')
    print('더 나은 미래를 위해 스스로를 단련시키고, 능력 개발을 위해 노력을 해야 할 시기이다.')
    print('한 곳에서 정체되어 있지 말고, 부지런히 움직이며 목표를 위해 나아가는 멋진 모습을 보이도록 하라. 위험이 다가오지 못하도록 더욱더 정진 할 때다.')
elif(years==2012)|(years==2000)|(years==1988)|(years==1976)|(years==1964)|(years==1952)|(years==1940):#용띠
    print('용띠입니다')
    print('다른 사람에게 피해가 갈 수도 있으나 대의를 위한 것에 중요성을 두고 진행하는 게 좋다. 옛날 좋지 않았던 인연을 다시 만날 수도 있으나 만반의 대비를 한다면 문제 될 건 없다.')
    print('새로운 일을 하려고 한다면, 지금까지 해온 일을 먼저 정리하고 진행하는 게 옳다.')
elif(years==2013)|(years==2001)|(years==1989)|(years==1977)|(years==1965)|(years==1953)|(years==1941):#뱀띠
    print('뱀띠입니다')
    print('집에 머무르는 시간을 많이 갖는 게 당신에게 유리하다. 그동안 스쳐간 친구나 동료들에게 안부의 전화라도 한번 걸어보는 게 훗날을 생각하면 유리할 것이다.')
    print('자중하면서 앞으로의 계획을 다시 점검하기에 좋은 날이다. 한차례 몸져누울 수도 있으나 곧 털고 일어난다.')
elif(years==2014)|(years==2002)|(years==1990)|(years==1978)|(years==1966)|(years==1954)|(years==1942):#말띠
    print('말띠입니다')
    print('힘든 일이 있으면 즐거운 일도 생기는 법이다. 오늘은 당신에게 어려움을 주었던 일이 해결되어 큰 즐거움을 가져다 줄 것이다.')
    print('하지만 너무 서두르게 되면 일을 망치게 되니 끝까지 최선을 다하는 게 좋다. 처음 만나는 상대방이 당신에게 호감을 갖는 날이기도 하다.')
elif(years==2015)|(years==2003)|(years==1991)|(years==1979)|(years==1967)|(years==1955)|(years==1943):#양띠
    print('양띠입니다')
    print('내 주관을 가지고 행동하지 못하고 다른 사람의 의견에 끌려 다니면 오히려 나쁜 결과를 얻을 수도 있는 날이다.')
    print('차라리 모든 상황을 뒤로 하고, 마음의 여유를 찾기 위해 기분전환이나 운동을 하는 것이 효율적일 수도 있겠다.')
elif(years==2016)|(years==2004)|(years==1992)|(years==1980)|(years==1968)|(years==1956)|(years==1944):#원숭이띠
    print('원숭이띠입니다')
    print('신뢰했던 사람에게 좋지 않은 일이 생길 수도 있으니, 사람을 사귀거나 대하는 데 신중을 기하는 편이 유리하다.')
    print('당장 크게 수익이 나지 않는다 하여 일찍 포기하는 것은 어리석을 수 있다. 곧 지출보다 수입이 많을 것이니 좀 더 인내하도록 하자. 수입이 늘어날 시라도 만약을 위해 검소한 삶이 필요할 것이니 유념하라.')
elif(years==2017)|(years==2005)|(years==1993)|(years==1981)|(years==1969)|(years==1957)|(years==1945):#닭띠
    print('닭띠입니다')
    print('건강이 최고의 자산이다. 건강을 해치면 아무리 많은 부귀나 높은 지위도 소용없다는 것은 알고 있으니 가벼운 운동으로 건강을 지키려는 노력이 필요하다.')
    print('또한, 사회적 지위가 높아질수록 주위사람의 시선이 부담스럽게 느껴질 수 있으니 고개 숙임에 인색하지 않음이 이롭다.')
elif(years==2018)|(years==2006)|(years==1994)|(years==1982)|(years==1970)|(years==1958)|(years==1946):#개띠
    print('개띠입니다')
    print('지금은 한 우물을 파야만 나은 결과를 얻을 수 있으니, 여러 곳에 당신의 정력을 낭비하지 말고 한 곳에만 능력을 집중할 필요가 있겠다. 새로운 일에 대해서 지나치게 집착하지 않도록 하라.')
    print('당신에게 주어진 본래의 의무가 가장 최선이다..')
elif(years==2019)|(years==2007)|(years==1995)|(years==1983)|(years==1971)|(years==1959)|(years==1947):#돼지띠
    print('돼지띠입니다')
    print('서로 다른 생각을 하는 사람들이 모여 있으니 마음이 편치 않을 수도 있는 날이다. 세상 이치도 다 그런거다. 자신이 원하고 생각하는 대로 움직이는 건 하나도 없다고 느껴지는 그런 날이다.')
    print('하지만 조만간 음지에 햇볕이 드니 새로이 발생할 것들에 대해 너무 깊이 생각하지 말도록 하라..')
else:
    print('아직 저장되지 않은 년도입니다.')